20260824/20260824/Documents/ПланПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПланПроизводства</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбновитьДополнить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПользовательскиеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравилоЗаполнения</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

20260824/20260824/Enums/СтатусыПланов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыПланов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВПодготовке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

20260824/20260824/Documents/ПланПроизводства/Ext/ManagerModule.bsl
&Вместо("ЗаполнитьПоПравилуЗаполнения")
Процедура СБ_ЗаполнитьПоПравилуЗаполнения(Знач Параметры, Знач АдресХранилища)
	Если Параметры.Свойство("Периоды") = Ложь Тогда
		
		ТаблицаПериоды = Планирование.ТаблицаПериоды();
		Планирование.ЗаполнитьТаблицуПериодов(ТаблицаПериоды, Параметры.Периодичность, Параметры.НачалоПериода, Параметры.ОкончаниеПериода);
		Параметры.Вставить("Периоды", ТаблицаПериоды);
		
		ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыВыбораСпецификаций();
		ПараметрыВыбораСпецификаций.ДоступныеТипы.Добавить(Перечисления.ТипыПроизводственныхПроцессов.Сборка);
		ПараметрыВыбораСпецификаций.ДоступныеСтатусы.Добавить(Перечисления.СтатусыСпецификаций.Действует);
		Параметры.Вставить("ПараметрыВыбораСпецификаций", ПараметрыВыбораСпецификаций);
		
		//АдресПравилаЗаполнения = "";
		АдресПравилаЗаполнения = Планирование.ПолучитьАдресПравилаЗаполненияПоУмолчанию(Перечисления.ТипыПланов.ПланПроизводства, Параметры.ВидПлана, Новый УникальныйИдентификатор);
		Параметры.Вставить("ПравилоЗаполнения", ПолучитьИзВременногоХранилища(АдресПравилаЗаполнения));
		
		//АдресПользовательскихНастроек = "";
		АдресПользовательскихНастроек = Планирование.ПолучитьАдресПользовательскихНастроекПоУмолчанию(Перечисления.ТипыПланов.ПланПроизводства, Параметры.ВидПлана, Новый УникальныйИдентификатор);
		
		Параметры.Вставить("ПользовательскиеНастройки", ПолучитьИзВременногоХранилища(АдресПользовательскихНастроек));
	КонецЕсли;
	
	ПродолжитьВызов(Параметры, АдресХранилища);
КонецПроцедуры

Процедура СБ_СоздатьЗаполнитьДокументыКооперации(Период) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НетОбновленныхДокументов = Ложь;
	КоличествоКругов = 0;
	
	ВидыПланов = Новый Массив;
	ВидыПланов.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.СБ_Предопределенные.Кооперация"), "Значение"));
	ВидыПланов.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.СБ_Предопределенные.ОбеспечениеМернымиЛентами"), "Значение"));
	
	Пока НетОбновленныхДокументов = Ложь И КоличествоКругов < 100 Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СтруктураПредприятия.Ссылка КАК Подразделение
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.ПодразделениеДиспетчер = ИСТИНА
		|	И СтруктураПредприятия.ПометкаУдаления = ЛОЖЬ";
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		НетОбновленныхДокументов = Истина;
		
		Пока Выборка.Следующий() Цикл
			Для Каждого ВидПлана Из ВидыПланов Цикл
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ПланПроизводства.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ПланПроизводства КАК ПланПроизводства
				|ГДЕ
				|	ПланПроизводства.Подразделение = &Подразделение
				|	И ПланПроизводства.НачалоПериода = &НачалоПериода
				|	И ПланПроизводства.ОкончаниеПериода = &ОкончаниеПериода
				|	И ПланПроизводства.ВидПлана = &ВидПлана
				|	И ПланПроизводства.ПометкаУдаления = ЛОЖЬ";
				Запрос.УстановитьПараметр("Подразделение", Выборка.Подразделение);
				Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
				Запрос.УстановитьПараметр("ОкончаниеПериода", НачалоДня(КонецМесяца(Период)));
				Запрос.УстановитьПараметр("ВидПлана", ВидПлана);
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаДокументов = РезультатЗапроса.Выбрать();
				Если ВыборкаДокументов.Следующий() Тогда
					ДокументКооперации = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
				Иначе
					ДокументКооперации = Документы.ПланПроизводства.СоздатьДокумент();
					ДокументКооперации.Сценарий = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.СБ_Предопределенные.ПроизводствоПоЦехам"), "Значение");
					ДокументКооперации.ВидПлана = ВидПлана;
					ДокументКооперации.СценарийБюджетирования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.СБ_Предопределенные.Оперативный"), "Значение");
					ДокументКооперации.Периодичность = ПредопределенноеЗначение("Перечисление.Периодичность.День");
					ДокументКооперации.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					ДокументКооперации.Дата = ТекущаяДатаСеанса();
					ДокументКооперации.НачалоПериода = НачалоМесяца(Период);
					ДокументКооперации.ОкончаниеПериода = НачалоДня(КонецМесяца(Период));
					ДокументКооперации.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПланов.Утвержден");
					ДокументКооперации.Подразделение = Выборка.Подразделение;
					ДокументКооперации.КроссТаблица = Истина;
					ДокументКооперации.ЗаполнятьПоФормуле = Истина;
					ДокументКооперации.ЗаполненоАвтоматически = Истина;
					
					НастройкиПроизводства = ПроизводствоСервер.НастройкиПодсистемыПроизводство();
					ДокументКооперации.УправлениеПроизводством2_2 = НастройкиПроизводства.ИспользуетсяПроизводство22;
					ДокументКооперации.СБ_ЗаполнитьРеквизитыПланаПоСценариюВидуПлана(Ложь);
				КонецЕсли;
				
				ДокументКооперации.ЗаполнитьПоПравилуЗаполнения();
				
				ПараметрыВыбораСпецификаций = УправлениеДаннымиОбИзделиях.ПараметрыВыбораСпецификаций(ДокументКооперации, Документы.ПланПроизводства);
				ПараметрыВыбораСпецификаций.ДоступныеТипы.Добавить(Перечисления.ТипыПроизводственныхПроцессов.Сборка);
				ПараметрыВыбораСпецификаций.ДоступныеСтатусы.Добавить(Перечисления.СтатусыСпецификаций.Действует);
				
				Для Каждого СтрокаПродукция Из ДокументКооперации.Продукция Цикл
					
					СтруктураДействий = Новый Структура;
					КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
					ПараметрыЗаполнения = УправлениеДаннымиОбИзделияхКлиентСервер.ПараметрыДействияПроверитьЗаполнитьСпецификацию(
					ДокументКооперации,
					СтрокаПродукция,
					ПараметрыВыбораСпецификаций,,
					Новый Структура("КлючПутейКДанным", "Объект.Продукция"));
					
					СтруктураДействий.Вставить("ПроверитьЗаполнитьСпецификацию", ПараметрыЗаполнения);
					ПакетнаяОбработкаТабличнойЧастиСервер.ПроверитьЗаполнитьСпецификацию(СтрокаПродукция, СтруктураДействий, КэшированныеЗначения)
					
				КонецЦикла;
				
				Если ДокументКооперации.ЭтоНовый() Тогда
					ТЧИзменилась = ДокументКооперации.Продукция.Количество() > 0;
				Иначе 
					ТЧИзменилась = Не ОбщегоНазначения.КоллекцииИдентичны(ДокументКооперации.Ссылка.Продукция.Выгрузить(),ДокументКооперации.Продукция.Выгрузить(), "Номенклатура, КоличествоУпаковок, ДатаВыпуска");
				КонецЕсли;
				
				Если ТЧИзменилась Тогда
					НетОбновленныхДокументов = Ложь;
					УстановитьПометку = Ложь;
					Если ДокументКооперации.Продукция.Количество() = 0 И Не ДокументКооперации.ЭтоНовый() Тогда
						УстановитьПометку = Истина;
					КонецЕсли;
					Попытка
						ДокументКооперации.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ДокументКооперации.Записать();
					КонецПопытки;
					Если УстановитьПометку Тогда
						ДокументКооперации.УстановитьПометкуУдаления(Истина);
						ДокументКооперации.Записать();
					КонецЕсли;
					ПроведениеВыполнилось = Ложь;
					Пока Не ПроведениеВыполнилось Цикл
						Запрос = Новый Запрос;
						Запрос.Текст = 
						"ВЫБРАТЬ
						|	ОчередьРасчетаПланаПроизводства.ПланПроизводства КАК ПланПроизводства
						|ИЗ
						|	РегистрСведений.ОчередьРасчетаПланаПроизводства КАК ОчередьРасчетаПланаПроизводства
						|ГДЕ
						|	ОчередьРасчетаПланаПроизводства.ПланПроизводства = &ПланПроизводства";
						Запрос.УстановитьПараметр("ПланПроизводства", ДокументКооперации.Ссылка);
						РезультатЗапроса = Запрос.Выполнить();
						ВыборкаЗаданий = РезультатЗапроса.Выбрать();
						Если ВыборкаЗаданий.Следующий() Тогда
							ПроведениеВыполнилось = Ложь;
							
						Иначе
							ПроведениеВыполнилось = Истина;
						КонецЕсли;
					КонецЦикла;
					
					
				КонецЕсли;
			КонецЦикла;	
		КонецЦикла;
		ДлительныеОперации.СообщитьПрогресс(КоличествоКругов, "Выполняется операция: " + КоличествоКругов + "%");
		КоличествоКругов = КоличествоКругов + 10;
	КонецЦикла;
	ДлительныеОперации.СообщитьПрогресс(100, "Выполняется операция: " + КоличествоКругов + "%");
КонецПроцедуры
